Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroup.Attributes Property
 Gets or sets the attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementSetGroupAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementSetGroupAttributes Attributes { get; set; }
Public Property Attributes As ReinforcementBase.ReinforcementSetGroupAttributes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementSetGroupAttributes
See Also
Reference
ReinforcementSetGroup Class
Tekla.Structures.Drawing Namespace